Repository: translaster/jupyter
Catalog: docs/source/locale/*/LC_MESSAGES/architecture.po
Languages: ru_ru

source: Architecture
ru_ru: Архитектура

source: How IPython and Jupyter Notebook work
ru_ru: Как работают блокноты IPython и Jupyter

source: Contents
ru_ru: Содержание

source: Abstract
ru_ru: Абстрактный

source: This section focuses on IPython and Jupyter notebook and how they interact. When we discuss ``IPython``, we talk about two fundamental roles:
ru_ru: Этот раздел посвящен IPython и блокноту Jupyter и тому, как они взаимодействуют. Когда мы обсуждаем ``IPython`` - мы говорим о двух фундаментальных ролях:

source: Terminal IPython as the familiar REPL
ru_ru: Терминал IPython в качестве знакомого REPL

source: The IPython kernel that provides computation and communication with the frontend interfaces, like the notebook
ru_ru: Ядро IPython, обеспечивающее вычисления и связь с интерфейсами фронтенда, например с блокнотом

source: Jupyter Notebook and its flexible interface extends the notebook beyond code to visualization, multimedia, collaboration, and more.
ru_ru: Jupyter Notebook и его гибкий интерфейс расширяют возможности блокнота за пределами кода до визуализации, мультимедиа, совместной работы и многого другого.

source: Terminal IPython
ru_ru: Терминал IPython

source: When you type ``ipython``, you get the original IPython interface, running in the terminal. It does something like this::
ru_ru: Когда вы набираете ``ipython`` - вы получаете оригинальный интерфейс IPython, работающий в терминале. Он делает что-то вроде этого::

source: Of course, it's much more complex, because it has to deal with multi-line code, tab completion using :mod:`readline`, magic commands, and so on. But the model is like code example: prompt the user for some code, and when they've entered it, execute it in the same process. This model is often called a :term:`REPL`, or Read-Eval-Print-Loop.
ru_ru: Конечно, это гораздо сложнее, потому что он имеет дело с многострочным кодом, завершением вкладки с помощью :mod:`eadline`, волшебными командами и так далее. Но модель похожа на пример кода: запросите у пользователя какой-то код, и когда он его введет, выполните его в том же процессе. Эта модель часто называется :term:`REPL` или Read-Eval-Print-Loop (Чтение-оценка-вывод-петля).

source: The IPython Kernel
ru_ru: Ядро IPython

source: All the other interfaces —- the Notebook, the Qt console, ``ipython console`` in the terminal, and third party interfaces —- use the IPython Kernel. The IPython Kernel is a separate process which is responsible for running user code, and things like computing possible completions. Frontends, like the notebook or the Qt console, communicate with the IPython Kernel using JSON messages sent over `ZeroMQ <http://zeromq.org/>`_ sockets; the protocol used between the frontends and the IPython Kernel is described in :ref:`jupyterclient:messaging`.
ru_ru: Все остальные интерфейсы -- Notebook, консоль Qt, ``консоль IPython`` в терминале и сторонние интерфейсы - используют ядро IPython. Ядро IPython - это отдельный процесс, отвечающий за запуск пользовательского кода и такие вещи, как вычисление возможных завершений. Интерфейсы, такие как блокнот или консоль Qt, взаимодействуют с ядром IPython с помощью сообщений JSON, отправляемых через `ZeroMQ <http://zeromq.org/>`_ sockets; протокол, используемый между интерфейсами и ядром IPython, описан в разделе :ref:`jupyterclient:messaging'.

source: The core execution machinery for the kernel is shared with terminal IPython:
ru_ru: Механизм выполнения ядра для совместного использования ядра с терминалом IPython:

source: A kernel process can be connected to more than one frontend simultaneously. In this case, the different frontends will have access to the same variables.
ru_ru: Процесс ядра может быть подключен одновременно к нескольким интерфейсам. В этом случае разные интерфейсы будут иметь доступ к одним и тем же переменным.

source: This design was intended to allow easy development of different frontends based on the same kernel, but it also made it possible to support new languages in the same frontends, by developing kernels in those languages, and we are refining IPython to make that more practical.
ru_ru: Эта конструкция была предназначена для облегчения разработки различных интерфейсов на основе одного и того же ядра, но она также позволила поддерживать новые языки в одних и тех же интерфейсах, разрабатывая ядра на этих языках, и мы совершенствуем IPython, чтобы сделать это более практичным.

source: Today, there are two ways to develop a kernel for another language. Wrapper kernels reuse the communications machinery from IPython, and implement only the core execution part. Native kernels implement execution and communications in the target language:
ru_ru: Сегодня существует два способа разработки ядра для другого языка. Ядра-оболочки повторно используют коммуникационное оборудование IPython и реализуют только часть выполнения ядра. Нативные ядра реализуют выполнение и коммуникацию на целевом языке:

source: Wrapper kernels are easier to write quickly for languages that have good Python wrappers, like `octave_kernel <https://pypi.python.org/pypi/octave_kernel>`_, or languages where it's impractical to implement the communications machinery, like `bash_kernel <https://pypi.python.org/pypi/bash_kernel>`_. Native kernels are likely to be better maintained by the community using them, like `IJulia <https://github.com/JuliaLang/IJulia.jl>`_ or `IHaskell <https://github.com/gibiansky/IHaskell>`_.
ru_ru: Ядра-оболочки обычно легче писать для языков, которые имеют хорошие оболочки Python, например `octave_kernel <https://pypi.python.org/pypi/octave_kernel>`_, или языки, где нецелесообразно реализовывать коммуникационный механизм, например `bash_kernel <https://pypi.python.org/pypi/bash_kernel>`_. Нативные ядра, вероятно, будут лучше поддерживаться сообществом, использующим их, например `Julia <https://github.com/JuliaLang/IJulia.jl>`_ или `IHaskell <https://github.com/gibiansky/IHaskell>`_.

source: :ref:`Kernels <kernels-langs>`
ru_ru: :ref:`Ядра <kernels-langs>`

source: Notebooks
ru_ru: Блокноты

source: The Notebook frontend does something extra. In addition to running your code, it stores code and output, together with markdown notes, in an editable document called a notebook. When you save it, this is sent from your browser to the notebook server, which saves it on disk as a JSON file with a ``.ipynb`` extension.
ru_ru: Фронтенд блокнота делает что-то дополнительное. Помимо выполнения кода, он хранит код и выходные данные вместе с заметками markdown в редактируемом документе, называемом блокнотом. Когда вы сохраняете его - он отправляется из Вашего браузера на сервер блокнота, который сохраняет его на диске в виде файла JSON с расширение ``.ipynb``.

source: The notebook server, not the kernel, is responsible for saving and loading notebooks, so you can edit notebooks even if you don't have the kernel for that language—you just won't be able to run code. The kernel doesn't know anything about the notebook document: it just gets sent cells of code to execute when the user runs them.
ru_ru: Сервер блокнота, а не ядро, отвечает за сохранение и загрузку блокнотов, поэтому вы можете редактировать блокноты, даже если у вас нет ядра для этого языка — вы просто не сможете запускать код. Ядро ничего не знает о документе в блокноте: оно просто получает ячейки кода для выполнения, когда пользователь запускает их.

source: Exporting notebooks to other formats
ru_ru: Экспорт блокнотов в другие форматы

source: The Nbconvert tool in Jupyter converts notebook files to other formats, such as HTML, LaTeX, or reStructuredText. This conversion goes through a series of steps:
ru_ru: Инструмент Nbconvert в Jupiter преобразует файлы блокнота в другие форматы, такие как HTML, LaTeX или reStructuredText. Это преобразование проходит через ряд шагов:

source: Preprocessors modify the notebook in memory. E.g. ExecutePreprocessor runs the code in the notebook and updates the output.
ru_ru: Препроцессоры модифицируют блокнот в памяти. Например, препроцессор Execute запускает код в блокноте и обновляет выходные данные.

source: An exporter converts the notebook to another file format. Most of the exporters use templates for this.
ru_ru: Экспортер преобразует блокнот в другой формат файла. Большинство экспортеров используют для этого шаблоны.

source: Postprocessors work on the file produced by exporting.
ru_ru: Постпроцессоры работают над файлом, полученным при экспорте.

source: The `nbviewer <http://nbviewer.jupyter.org/>`_ website uses nbconvert with the HTML exporter. When you give it a URL, it fetches the notebook from that URL, converts it to HTML, and serves that HTML to you.
ru_ru: Вебсайт `nbviewer <http://nbviewer.jupyter.org/>`_ использует nbconvert с экспортером HTML. Когда вы даете ему URL-адрес - он извлекает блокнот из этого URL-адреса, преобразует его в HTML и передает вам этот HTML-код.

source: IPython also includes a parallel computing framework, `IPython.parallel <https://ipyparallel.readthedocs.io/en/latest/>`_. This allows you to control many individual engines, which are an extended version of the IPython kernel described above.
ru_ru: IPython также включает в себя параллельную вычислительную платформу, `IPython.parallel <https://ipyparallel.readthedocs.io/en/latest/>`_. Это позволяет управлять многими отдельными движками, которые являются расширенной версией ядра IPython, описанного выше.

source: A Visual Overview of Projects
ru_ru: Визуальный обзор проектов

source: **A high level visual overview of project relationships**
ru_ru: **Высокоуровневый визуальный обзор проектных взаимосвязей**
