Repository: translaster/jupyter
Catalog: docs/source/locale/*/LC_MESSAGES/reference.po
Languages: ru_ru

source: Reference
ru_ru: Справочник

source: Resources
ru_ru: Ресурсы

source: # Custom mimetypes (MIME types)
ru_ru: # Пользовательские mime-типы (типы MIME)

source: ## What's a mimetype?
ru_ru: ## Что такое mime-тип?

source: When an internet request and response occurs, a `Content-Type` header is passed. A mimetype, also referred to as MIME type, identifies how the content that is being returned should be handled or used, based on type, by the application and browser. A MIME type is made up of a MIME *group* (i.e. application, image, audio, etc.) and a MIME *subtype*. For example, a MIME type is `image/png` where MIME *group* is `image` and *subtype* is `png`.
ru_ru: При интернет-запросе и ответе передается заголовок `Content-Type`. Тип mime, также называемый типом MIME, определяет, как возвращаемое содержимое должно обрабатываться или использоваться приложением и браузером в зависимости от типа. Тип MIME состоит из *группы* MIME (то есть приложение, изображение, аудио и т. д.) и *подтип* MIME. Например, тип MIME `image/png`, где MIME *группа* - это `image`, а *подтип* - это `png`.

source: As types may contain vendor specific items, a [custom vendor specific MIME type](https://en.wikipedia.org/wiki/Media_type#Vendor_tree), `vnd`, can be used. A vendor specific MIME type will contain `vnd` such as `application/vnd.jupyter.cells`.
ru_ru: Как типы могут содержать конкретные элементы вендора, [пользовательский MIME-типа определенного вендора](https://ru.wikipedia.org/wiki/Список_MIME-типов#vnd), `vnd` может быть использован. Конкретный MIME-тип вендора будет содержать `vnd`, например `application/vnd.jupyter.cells`.

source: ## Custom mimetypes used in Jupyter and IPython projects
ru_ru: ## Пользовательские mime-типы, используемые в проектах Jupyter и IPython

source: `application/vnd.jupyter.dragindex` used by nbdime
ru_ru: `application/vnd.jupyter.dragindex` используется nbdime

source: `application/x-ipynb+json` for notebooks
ru_ru: `application/x-ipynb+json` для блокнотов

source: metadata:
ru_ru: метаданные:

source: `isolated: boolean` -- HTML should be rendered inside an `<iframe>`.
ru_ru: `isolated: boolean` -- HTML должен быть отображен внутри `<iframe>`.

source: ## Listing of custom mimetypes used for display
ru_ru: ## Список пользовательских mime-типов, используемых для отображения

source: `application/vnd.geo+json` - [GeoJSON spec](http://geojson.org/geojson-spec.html) `application/vnd.geo+json` is now deprecated and replaced by `application/geo+json`
ru_ru: `application/vnd.geo+json` - [специфик-я GeoJSON](http://geojson.org/geojson-spec.html) `application/vnd.geo+json` теперь устарело и заменено на `application/geo+json`

source: `application/geo+json` - preferred [GeoJSON spec](http://geojson.org/geojson-spec.html)
ru_ru: `application/geo+json` - предпочтительный [специфик-я GeoJSON](http://geojson.org/geojson-spec.html)

source: `application/vnd.plotly.v1+json` - [Plotly JSON Schema](http://help.plot.ly/json-chart-schema/)
ru_ru: `application/vnd.plotly.v1+json` - [Схема Plotly JSON](http://help.plot.ly/json-chart-schema/)

source: `application/vdom.v1+json` - [Virtual DOM spec](https://github.com/nteract/vdom/blob/master/docs/spec.md)
ru_ru: `application/vdom.v1+json` - [специфик-я Virtual DOM](https://github.com/nteract/vdom/blob/master/docs/spec.md)
