Repository: translaster/jupyter
Catalog: docs/source/locale/*/LC_MESSAGES/running.po
Languages: ru_ru

source: Running the Notebook
ru_ru: Запуск Notebook

source: Contents
ru_ru: Содержание

source: Basic Steps
ru_ru: Основные этапы

source: Start the notebook server from the :term:`command line`::
ru_ru: Запустите сервер блокнота из :term:`command line`::

source: You should see the notebook open in your browser.
ru_ru: Вы должны увидеть открытый блокнот в вашем браузере.

source: Starting the Notebook Server
ru_ru: Запуск сервера Notebook

source: After you have installed the Jupyter Notebook on your computer, you are ready to run the notebook server. You can start the notebook server from the :term:`command line` (using :term:`Terminal` on Mac/Linux, :term:`Command Prompt` on Windows) by running::
ru_ru: После того, как вы установили Jupyter Notebook на свой компьютер, вы можете запустить сервер блокнотов. Вы можете запустить сервер блокнотов из :term:`command line` (используя :term:`Terminal` в Mac/Linux, :term:`Command Prompt` в Windows), запустив::

source: This will print some information about the notebook server in your terminal, including the URL of the web application (by default, ``http://localhost:8888``):
ru_ru: Это приведет к печати некоторой информации о сервере блокнотов в вашем терминале, включая URL-адрес веб-приложения (по умолчанию ``http://localhost:8888``):

source: It will then open your default web browser to this URL.
ru_ru: Он откроется в браузере по умолчанию для данного URL-адреса.

source: When the notebook opens in your browser, you will see the :term:`Notebook Dashboard`, which will show a list of the notebooks, files, and subdirectories in the directory where the notebook server was started. Most of the time, you will wish to start a notebook server in the highest level directory containing notebooks. Often this will be your home directory.
ru_ru: Когда блокнот в вашем браузере - вы увидите :term:`Notebook Dashboard`, который покажет список блокнотов, файлов и подкаталогов в каталоге, где был запущен сервер блокнотов. В большинстве случаев вам необходимо запустить сервер блокнотов в каталоге самого высокого уровня, содержащем блокноты. Часто это будет ваш домашний каталог.

source: **Notebook Dashboard**
ru_ru: **Панель мониторинга Notebook**

source: Introducing the Notebook Server's Command Line Options
ru_ru: Знакомство с параметрами командной строки сервера Notebook

source: How do I open a specific Notebook?
ru_ru: Как открыть конкретный блокнот?

source: The following code should open the given notebook in the currently running notebook server, starting one if necessary.
ru_ru: Следующий код должен открыть данный блокнот на текущем сервере блокнотов, запустив его при необходимости.

source: How do I start the Notebook using a custom IP or port?
ru_ru: Как запустить блокнот с помощью собственного IP-адреса или порта?

source: By default, the notebook server starts on port 8888. If port 8888 is unavailable or in use, the notebook server searches the next available port. You may also specify a port manually. In this example, we set the server's port to 9999:
ru_ru: По умолчанию сервер блокнотов запускается через порт 8888. Если порт 8888 недоступен или используется - сервер блокнотов ищет следующий доступный порт. Вы также можете указать порт вручную. В этом примере мы устанавливаем порт сервера на 9999:

source: How do I start the Notebook server without opening a browser?
ru_ru: Как запустить сервер блокнота без открытия браузера?

source: Start notebook server without opening a web browser:
ru_ru: Запустить сервер блокнотов не открывая веб-браузер:

source: How do I get help about Notebook server options?
ru_ru: Как получить справку о параметрах сервера Notebook?

source: The notebook server provides help messages for other command line arguments using the ``--help`` flag:
ru_ru: Сервер блокнотов предоставляет справочные сообщения для других аргументов командной строки, используя флаг ``--help``:

source: :ref:`Jupyter Installation, Configuration, and Usage <content-projects>`
ru_ru: :ref:`Установка, настройка и использование Jupiter <content-projects>`

source: Detailed information about command line arguments, configuration, and usage.
ru_ru: Подробная информация об аргументах командной строки, конфигурации и использовании.
